Revit 2024 API
TemperatureRatingType.RemoveWireSize Method
 Remove an existing wire size type from this temperature rating type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void RemoveWireSize(
	WireSize wireSize
)
Visual Basic
Public Sub RemoveWireSize ( _
	wireSize As WireSize _
)
Visual C++
public:
void RemoveWireSize(
	WireSize^ wireSize
)
Parameters
wireSize
Type: Autodesk.Revit.DB.Electrical.WireSize
The wire size type to be removed.
See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace